ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Kunai (AVR32DU20)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Kunai (Seeeduino XIAO form factor, AVR32DU20, USB-C)
 * MCU     : AVR32DU20  (20-pin VQFN/SSOP)
 * Clock   : internal 24 MHz OSCHF, crystal-less (boards.txt: clocksource = 0).
 *           USB CLK_USB (48 MHz) = OSCHF + PLL48M, auto-tuned to the USB SOF.
 *           PA0/PA1 therefore stay plain GPIO (D6/D7 = the Serial1 UART).
 *
 *  ===== Pin numbering: Seeeduino XIAO compatible (NONCANONICAL) =====
 *   D#   MCU   XIAO role / notes                             A#,  AIN
 *   D0   PC3   A0 | ~PWM(TCB1 via CCL LUT1)                  A0,  AIN31
 *   D1   PA7   A1 | SPI SS | AC0 OUT | EVOUTA | CLKOUT       A1,  AIN27
 *   D2   PD6   A2 | Serial2 TX (USART1 ALT2) | LUT2-OUT alt  A2,  AIN6
 *   D3   PD7   A3 | Serial2 RX (USART1 ALT2) | EVOUTD        A3,  AIN7
 *   D4   PA2   A4 | SDA (TWI0 default) | ~PWM(TCA0 WO2)      A4,  AIN22
 *   D5   PA3   A5 | SCL (TWI0 default) | ~PWM(TCA0 WO3)      A5,  AIN23
 *   D6   PA0   TX (Serial1 / USART0 default) | ~PWM(WO0)     -    (no ADC)
 *   D7   PA1   RX (Serial1 / USART0 default) | ~PWM(WO1)     -    (no ADC)
 *   D8   PA6   SPI SCK                                       A8,  AIN26
 *   D9   PA5   SPI MISO | ~PWM(TCA0 WO5)                     A9,  AIN25
 *   D10  PA4   SPI MOSI | ~PWM(TCA0 WO4)                     A10, AIN24
 *   D11  PD4   LED_BUILTIN | USB-CDC TX activity LED         A11, AIN4
 *   D12  PD5   USB-CDC RX activity LED                       A12, AIN5
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PF6   RESET                                index 15
 *        PF7   UPDI                                 index 16  (== PIN_PF7, highest)
 *   (D13/D14 do not exist as pins: indices 13/14 are gaps, so XIAO sketches
 *    that blink the user LED "13" become harmless no-ops. The Seeeduino XIAO
 *    puts its TX LED on 11 and RX LED on 12; rev.3 follows that numbering.)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTA (WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9) : TCA0_PINS below
 *   TCB1  -> D0 PWM *through CCL LUT1*: D0 is PC3 = LUT1-OUT (default position).
 *           TCB1 runs in 8-bit PWM mode and its internal WO signal feeds LUT1
 *           (INSEL1 = TCB, DS40002548A 30.2.2.1); the LUT passes it to the pin.
 *           analogWrite(D0, x) does all of this transparently (core
 *           wazamono_lutpwm.c). TCB1's own WO pin position is parked on ALT1
 *           (TCB1_PINS): ALT1 = PF5, which does not exist on the 20-pin DU -
 *           the parking spot is entirely harmless here.
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone()
 *           and D0 PWM share TCB1: calling tone() suspends D0 PWM only.
 *           Likewise, taking LUT1 over (direct CCL register use) suspends D0
 *           PWM: analogWrite(D0) then falls back to plain digital output.
 *   SPI0  -> DEFAULT (PA4 MOSI / PA5 MISO / PA6 SCK / PA7 SS = D10/D9/D8/D1).
 *           Board is SPI host; run with Client Select Disable (SSD=1) so D1's
 *           level cannot flip host -> client mode. D1 doubles as software CS.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D4/D5 = A4/A5 (XIAO I2C position).
 *   USART0-> user-facing "Serial1", DEFAULT position (PA0 TX / PA1 RX = D6/D7,
 *           the XIAO UART position). The object is Serial0; UART0.cpp emits the
 *           Serial1 alias (WAZAMONO_SERIAL1_IS_USART0).
 *   USART1-> user-facing "Serial2", ALT2 (PD6 TX / PD7 RX = D2/D3)
 *           (WAZAMONO_SERIAL2_IS_USART1; the only USART1 position on the DU).
 *   CCL   -> LUT0 is the CustomLogic user unit (IN0/IN1/IN2 = D6/D7/D4,
 *           OUT = D5, alt OUT = D8). LUT1 belongs to D0 PWM (above). LUT2's
 *           alternate output pin is D2 (PD6); its input pins do not exist on
 *           the DU-20. LUT3 has no pins here.
 *   LED   -> PD4 (D11) is LED_BUILTIN and doubles as the USB-CDC TX activity
 *           LED; PD5 (D12) is the USB-CDC RX activity LED (XIAO numbering:
 *           TX = 11, RX = 12; weak hooks in usb_cdc.c, overridden in
 *           wazamono_kunai_init.cpp). Both LEDs are active-LOW (matching the
 *           bootloader's PD4 blink).
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Board identification: ARDUINO_AVR_KUNAI is THE macro that identifies this
 * board, following the Arduino convention (ARDUINO_AVR_PROMICRO, ARDUINO_UNOWIFIR4).
 * The Arduino build system defines it from boards.txt (build.board=AVR_KUNAI
 * -> -DARDUINO_AVR_KUNAI); the fallback below covers builds outside the IDE
 * (e.g. the bootloader tree, which passes it explicitly). It is used by the
 * core, the bundled libraries, the examples and the bootloader sources alike.
 * MCU identification comes from the compiler (-mmcu): __AVR_AVR32DU20__,
 * plus the core's family tags __AVR_DU__ / _AVR_FAMILY / _AVR_PINCOUNT
 * (core_devices.h).
 * DU_20PIN_PINOUT keeps DU-20 feature assumptions in the core;
 * NONCANONICAL_PIN_NUMBERS tells the core to derive (port,bit) from the tables
 * below instead of assuming pin number == port order. */
#ifndef ARDUINO_AVR_KUNAI
  #define ARDUINO_AVR_KUNAI 1
#endif
#define DU_20PIN_PINOUT
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (XIAO layout, D0..D10 + D13/D14) ---- */
#define PIN_PC3 (0)   // D0  A0 / ~PWM(TCB1 via CCL LUT1)
#define PIN_PA7 (1)   // D1  A1 / SPI SS / AC0 OUT / EVOUTA / CLKOUT
#define PIN_PD6 (2)   // D2  A2 / Serial2 TX (USART1 ALT2) / LUT2-OUT (alt)
#define PIN_PD7 (3)   // D3  A3 / Serial2 RX (USART1 ALT2) / EVOUTD
#define PIN_PA2 (4)   // D4  A4 / SDA (TWI0 default) / TCA0 WO2 / USART0 XCK
#define PIN_PA3 (5)   // D5  A5 / SCL (TWI0 default) / TCA0 WO3 / LUT0-OUT / USART0 XDIR
#define PIN_PA0 (6)   // D6  TX (Serial1 = USART0 default) / TCA0 WO0 / LUT0-IN0
#define PIN_PA1 (7)   // D7  RX (Serial1 = USART0 default) / TCA0 WO1 / LUT0-IN1
#define PIN_PA6 (8)   // D8  SPI SCK / LUT0-OUT (alt)
#define PIN_PA5 (9)   // D9  SPI MISO / TCA0 WO5
#define PIN_PA4 (10)  // D10 SPI MOSI / TCA0 WO4
#define PIN_PD4 (11)  // D11 LED_BUILTIN / USB-CDC TX activity LED
#define PIN_PD5 (12)  // D12 USB-CDC RX activity LED
#define PIN_PF6 (15)  // RESET
#define PIN_PF7 (16)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 17)

/* ---- Counts ---- */
#define PINS_COUNT                     (17)  // length of the pin tables (incl. reserved; 13/14 are gaps)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 17

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD4)   // D11, on-board LED (active-LOW)
#endif
#define LED_BUILTIN_TX                 (PIN_PD4)   // D11 doubles as USB-CDC TX activity LED
#define LED_BUILTIN_RX                 (PIN_PD5)   // D12 USB-CDC RX activity LED (active-LOW)

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * EventSystem library in its Wazamono form) route event outputs to these only.
 *   EVOUTA -> PA7 = D1   (PORTMUX ALT1; PA2/D4 stays I2C SDA)
 *   EVOUTD -> PD7 = D3   (PORTMUX ALT1; default PD2 does not exist on DU-20)
 *   EVOUTF -> none       (PF2 absent; PF7 alternate is the UPDI pin) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD7)
#define WAZAMONO_EVOUTD_ALT            (1)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ----
 * ADC channels per DS40002576A: PA0/PA1 have no ADC input on the DU-20. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PC3 ? 31 : (p) == PIN_PA7 ? 27 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA6 ? 26 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA4 ? 24 : (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) == 31 ? PIN_PC3 : (p) == 27 ? PIN_PA7 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 26 ? PIN_PA6 : (p) == 25 ? PIN_PA5 : \
    (p) == 24 ? PIN_PA4 : (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : NOT_A_PIN )

