ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD4 : NOT_A_PIN)))

/* ---- PWM ----
 * millis lives on TCB0 (boards.txt -DMILLIS_USE_TIMERB0), leaving TCB1 free for
 * D0 PWM and for tone(). D0 (PC3) is not a TCB WO pin: it is LUT1's output, and
 * analogWrite(D0) delivers TCB1's 8-bit PWM waveform through LUT1 (see the
 * WAZAMONO_TCB1_LUTPWM_* block below and cores/dxcore/wazamono_lutpwm.h).
 * tone(): Tone.cpp routes tone to TCB1 whenever millis is on TCB0, so tone
 * shares TCB1 with D0 PWM - calling tone() suspends D0 PWM only.
 * TCA0 -> PORTA: WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9. */
#if defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (0)                   /* TCB1 is millis; no TCB PWM */
#elif defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PC3)      /* TCB0=millis -> TCB1 free -> D0 PWM (via LUT1) */
#else
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PC3)
#endif
#define digitalPinHasPWMTCA(p) ( \
    (p) == PIN_PA0 || (p) == PIN_PA1 || (p) == PIN_PA2 || \
    (p) == PIN_PA3 || (p) == PIN_PA4 || (p) == PIN_PA5 )

/* TCA0 routed to PORTA: WO0..WO5 = PA0..PA5 = D6,D7,D4,D5,D10,D9. */
#define TCA0_PINS                       (PORTMUX_TCA0_PORTA_gc)
#define TCB0_PINS                       (0x00)   // TCB0 = millis; WO unused (default PA2 pos)
#define TCB1_PINS                       (0x02)   // PORTMUX.TCBROUTEA bit 1: TCB1 WO parked on ALT1.
                                                 // ALT1 = PF5, which does not exist on the 20-pin DU:
                                                 // the D0 waveform travels through LUT1, and the WO
                                                 // parking spot is harmless. (DS40002548A 17.3.5)

#define PIN_TCA0_WO0_INIT               (PIN_PA0)
#define PIN_TCB0_WO_INIT                (PIN_PA2)   // TCB0 = millis; not enabled for PWM
#define PIN_TCB1_WO_INIT                (NOT_A_PIN) // parked on ALT1/PF5 (absent on DU-20); PWM leaves via LUT1/D0

/* ---- D0 PWM: TCB1 through CCL LUT1 (core mechanism, wazamono_lutpwm.{h,c}) ----
 * analogWrite(D0, x) makes TCB1's PWM8 waveform reach D0 = PC3 = LUT1-OUT:
 *   TCB1 WO (internal) -> LUT1 INSEL1 = TCB -> TRUTH 0xCC -> PC3.
 * The digital_pin_to_timer[] entry for D0 is TIMERB1, which sends analogWrite()
 * down the standard TCB path; the macros below tell the core hook which LUT
 * carries the waveform. Conflicts disable D0 analogWrite automatically:
 * tone()/TCB1 reconfiguration (CNTMODE check) and LUT1 use by other code
 * (signature check in wazamono_lutpwm.c). LUT1 is not offered by the
 * CustomLogic library on the Kunai (its user unit is LUT0), so in practice
 * only direct CCL register use competes for it.
 * CCMPEN stays 0: the CCL taps the internal WO signal, which was measured on
 * silicon to run regardless of that bit (see wazamono_lutpwm.h). The exact
 * LUT1 -> PC3 path used here was part of that measurement. */
#define WAZAMONO_TCB1_LUTPWM_PIN        (PIN_PC3)   /* D0 */
#define WAZAMONO_TCB1_LUTPWM_LUT        (1)         /* LUT1 */
#define WAZAMONO_TCB1_LUTPWM_LUT_ALT    (0)         /* CCLROUTEA: LUT1-OUT default = PC3 */
#define WAZAMONO_TCB1_LUTPWM_CCMPEN     (0)         /* verified on silicon; leave at 0 */

#define digitalPinHasPWM(p)             (digitalPinHasPWMTCB(p) || digitalPinHasPWMTCA(p))

/* ---- SPI (host; chip-selects are user GPIO). Kunai uses the DEFAULT position ---- */
#define SPI_INTERFACES_COUNT            (1)
#define SPI_MUX                         (PORTMUX_SPI0_DEFAULT_gc)  // PA4/PA5/PA6
#define SPI_MUX_PINSWAP_NONE            (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                    (PIN_PA4)   // D10
#define PIN_SPI_MISO                    (PIN_PA5)   // D9
#define PIN_SPI_SCK                     (PIN_PA6)   // D8
#define PIN_SPI_SS                      (PIN_PA7)   // D1 (hardware SS position; host mode + SSD=1, software CS)
#define PIN_SPI_SS_HARDWARE             (PIN_PA7)   // the DEFAULT-position SS pin itself (client mode / SPISlave)

/* ---- TWI 0 (I2C on A4/A5 = D4/D5, XIAO convention; TWI0 DEFAULT position) ---- */
#define PIN_WIRE_SDA                    (PIN_PA2)   // D4 / A4
#define PIN_WIRE_SCL                    (PIN_PA3)   // D5 / A5
#define PIN_WIRE_SDA_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SDA_PINSWAP_3          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_3          (NOT_A_PIN)

/* ---- USART0 -> user-facing "Serial1" = the XIAO D6/D7 UART. DEFAULT position
 * (PA0 TX / PA1 RX; the chip is crystal-less, so PA0/PA1 are free for it).
 * The object is Serial0; UART0.cpp emits the Serial1 alias. ---- */
#ifndef WAZAMONO_SERIAL1_IS_USART0
  #define WAZAMONO_SERIAL1_IS_USART0
#endif
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc - PA0/PA1 = D6/D7 */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc - PA4..PA7 (= SPI) */)
#define HWSERIAL0_MUX_PINSWAP_2         (0x02 /* PORTMUX_USART0_ALT2_gc - PA2/PA3 (= I2C) */)
#define HWSERIAL0_MUX_PINSWAP_3         (0x03 /* PORTMUX_USART0_ALT3_gc - PD4..PD7 (= LEDs/Serial2) */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x05)
#define HWSERIAL0_MUX_DEFAULT          (0)   /* Kunai default: USART0 DEFAULT (PA0/PA1 = D6/D7). */
#define PIN_HWSERIAL0_TX                (PIN_PA0)
#define PIN_HWSERIAL0_RX                (PIN_PA1)
#define PIN_HWSERIAL0_XCK               (PIN_PA2)
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2      (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2      (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2    (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3      (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3      (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3     (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3    (PIN_PD7)

/* ---- USART1 -> user-facing "Serial2" on D2/D3 (ALT2 = PD6/PD7, the only
 * USART1 pin position on the DU). The object is Serial1; UART1.cpp renames it
 * to Serial2 (WAZAMONO_SERIAL2_IS_USART1). ---- */
#ifndef WAZAMONO_SERIAL2_IS_USART1
  #define WAZAMONO_SERIAL2_IS_USART1
#endif
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc - no pins */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 3 /* ALT1 absent on DU - placeholder */)
#define HWSERIAL1_MUX_PINSWAP_2         (0x02 << 3 /* PORTMUX_USART1_ALT2_gc - PD6/PD7 = D2/D3 */)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 3)
#define HWSERIAL1_MUX_DEFAULT          (2)   /* Kunai default: USART1 ALT2 (PD6/PD7 = D2/D3) */
#define PIN_HWSERIAL1_TX                (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK               (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR              (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_2      (PIN_PD6)
#define PIN_HWSERIAL1_RX_PINSWAP_2      (PIN_PD7)
#define PIN_HWSERIAL1_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2    (NOT_A_PIN)

/* ---- Arduino analog aliases. XIAO header = A0..A10 (A6/A7 skipped: PA0/PA1
 * have no ADC); the LED pins are also reachable as A11/A12. ---- */
#define PIN_A0   (PIN_PC3)   // D0
#define PIN_A1   (PIN_PA7)   // D1
#define PIN_A2   (PIN_PD6)   // D2
#define PIN_A3   (PIN_PD7)   // D3
#define PIN_A4   (PIN_PA2)   // D4   SDA
#define PIN_A5   (PIN_PA3)   // D5   SCL
#define PIN_A8   (PIN_PA6)   // D8
#define PIN_A9   (PIN_PA5)   // D9
#define PIN_A10  (PIN_PA4)   // D10
#define PIN_A11  (PIN_PD4)   // D11  LED_BUILTIN
#define PIN_A12  (PIN_PD5)   // D12

