ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* --- XIAO style number-prefixed digital pin aliases (D0..D12 contiguous) ---
 * D-number == Arduino digital pin number. Internal-only pins (PF6 RESET,
 * PF7 UPDI) are intentionally NOT exposed as Dn. D13/D14 do not exist. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D11
#undef D12
static const uint8_t D0  = PIN_PC3;  // A0 / ~PWM(TCB1 via CCL LUT1)
static const uint8_t D1  = PIN_PA7;  // A1 / SS
static const uint8_t D2  = PIN_PD6;  // A2 / Serial2 TX
static const uint8_t D3  = PIN_PD7;  // A3 / Serial2 RX
static const uint8_t D4  = PIN_PA2;  // A4 / SDA
static const uint8_t D5  = PIN_PA3;  // A5 / SCL
static const uint8_t D6  = PIN_PA0;  // TX (Serial1)
static const uint8_t D7  = PIN_PA1;  // RX (Serial1)
static const uint8_t D8  = PIN_PA6;  // SCK
static const uint8_t D9  = PIN_PA5;  // MISO
static const uint8_t D10 = PIN_PA4;  // MOSI
static const uint8_t D11 = PIN_PD4;  // LED_BUILTIN / USB-CDC TX activity LED
static const uint8_t D12 = PIN_PD5;  // USB-CDC RX activity LED

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;

/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

/* ---- Pin arrays (ARDUINO_MAIN). Indexed by digital pin number (0..16).
 * Indices 13 and 14 are gaps (NOT_A_PIN / NOT_A_PORT): the XIAO's "13" user
 * LED has no counterpart here, so digitalWrite(13, ...) is a harmless no-op. ---- */
#ifdef ARDUINO_MAIN
  const uint8_t digital_pin_to_port[] = {
    PC,         //  0 PC3  D0  A0 / TCB1 PWM via CCL LUT1
    PA,         //  1 PA7  D1  A1 / SS / AC0 OUT / EVOUTA
    PD,         //  2 PD6  D2  A2 / Serial2 TX
    PD,         //  3 PD7  D3  A3 / Serial2 RX / EVOUTD
    PA,         //  4 PA2  D4  A4 / SDA / TCA0 WO2
    PA,         //  5 PA3  D5  A5 / SCL / TCA0 WO3
    PA,         //  6 PA0  D6  TX / TCA0 WO0
    PA,         //  7 PA1  D7  RX / TCA0 WO1
    PA,         //  8 PA6  D8  SCK
    PA,         //  9 PA5  D9  MISO / TCA0 WO5
    PA,         // 10 PA4  D10 MOSI / TCA0 WO4
    PD,         // 11 PD4  D11 LED_BUILTIN / CDC TX LED
    PD,         // 12 PD5  D12 CDC RX LED
    NOT_A_PORT, // 13 (gap - no D13; XIAO user-LED writes become no-ops)
    NOT_A_PORT, // 14 (gap)
    PF,         // 15 PF6  RESET
    PF          // 16 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_position[] = {
    PIN3_bp,   //  0 PC3  D0
    PIN7_bp,   //  1 PA7  D1
    PIN6_bp,   //  2 PD6  D2
    PIN7_bp,   //  3 PD7  D3
    PIN2_bp,   //  4 PA2  D4
    PIN3_bp,   //  5 PA3  D5
    PIN0_bp,   //  6 PA0  D6
    PIN1_bp,   //  7 PA1  D7
    PIN6_bp,   //  8 PA6  D8
    PIN5_bp,   //  9 PA5  D9
    PIN4_bp,   // 10 PA4  D10
    PIN4_bp,   // 11 PD4  D11
    PIN5_bp,   // 12 PD5  D12
    NOT_A_PIN, // 13 (gap)
    NOT_A_PIN, // 14 (gap)
    PIN6_bp,   // 15 PF6  RESET
    PIN7_bp    // 16 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN3_bm,   //  0 PC3  D0
    PIN7_bm,   //  1 PA7  D1
    PIN6_bm,   //  2 PD6  D2
    PIN7_bm,   //  3 PD7  D3
    PIN2_bm,   //  4 PA2  D4
    PIN3_bm,   //  5 PA3  D5
    PIN0_bm,   //  6 PA0  D6
    PIN1_bm,   //  7 PA1  D7
    PIN6_bm,   //  8 PA6  D8
    PIN5_bm,   //  9 PA5  D9
    PIN4_bm,   // 10 PA4  D10
    PIN4_bm,   // 11 PD4  D11
    PIN5_bm,   // 12 PD5  D12
    NOT_A_PIN, // 13 (gap)
    NOT_A_PIN, // 14 (gap)
    PIN6_bm,   // 15 PF6  RESET
    PIN7_bm    // 16 PF7  UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. D0 (PC3) is marked TIMERB1: it carries TCB1's PWM through CCL LUT1
   * (see WAZAMONO_TCB1_LUTPWM_* above). millis = TCB0. */
  const uint8_t digital_pin_to_timer[] = {
    TIMERB1,      //  0 PC3  D0  (TCB1 PWM delivered via CCL LUT1)
    NOT_ON_TIMER, //  1 PA7  D1
    NOT_ON_TIMER, //  2 PD6  D2
    NOT_ON_TIMER, //  3 PD7  D3
    NOT_ON_TIMER, //  4 PA2  D4  (TCA0 WO2, dynamic; TCB0 WO = millis)
    NOT_ON_TIMER, //  5 PA3  D5  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, //  6 PA0  D6  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  7 PA1  D7  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  8 PA6  D8
    NOT_ON_TIMER, //  9 PA5  D9  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 10 PA4  D10 (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 11 PD4  D11
    NOT_ON_TIMER, // 12 PD5  D12
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 (gap)
    NOT_ON_TIMER, // 15 PF6  RESET
    NOT_ON_TIMER  // 16 PF7  UPDI
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (which does NOT include this
 *  file), so the values below are informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x000A, product "Wazamono Kunai".
 *  Obtain a real product VID/PID before release (pid.codes = dev only).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x000A
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "Wazamono Kunai"
#endif

