ws-asahi/UkiUkiCore/megaavr/variants/WazamonoKunai/pins_arduino.h
/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D6 TX / D7 RX - the XIAO UART position; Uno R4-style
 *                      naming. Alias of Serial0 - both names reach the port.)
 *  Serial2 = USART1   (D2 TX / D3 RX, ALT2 - the DU's only USART1 position.)
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* XIAO D6/D7 hardware UART (USART0) */
  #endif
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN  Serial2  /* free hardware UART on D2/D3 (USART1) */
  #endif
#endif

/* ---- analogReference(): EXTERNAL disabled on Kunai ----
 * PD7 (the VREFA pin) is repurposed as D3 (Serial2 RX / EVOUTD), so there is
 * no external reference input. Undefining EXTERNAL turns analogReference(
 * EXTERNAL) into a compile error, steering sketches to the internal references
 * (1.024/2.048/2.5/4.096 V) or VDD. (Included from Arduino.h AFTER EXTERNAL
 * is defined.) */
#ifdef EXTERNAL
  #undef EXTERNAL
#endif

#endif
